#include <iostream>
#include <math.h>

using namespace std;

int main ()
{
    
    // Виконання завдання №1 варіант №14, студент групи АВ-109, Ситник Д. О.
    
    /*
    int R, x=5;
    R = (pow(sin(pow(x, 2) + 4), 3) + 4.3) / pow(sin(pow(x, 4)), 3);
    */
    
    /*
    Спочатку виконається чисельник, а саме x^2 ==> x^2+4 ==> sin(x^2+4)^3 ==> sin(x^2+4)^3 + 4.3
    Далі знаменник: x^4 ==> sin(x^4)^3
    Далі ділення чисельника на знаменник
    */
    
    
    
    /*
    Виконання завдання №2 варіант №14, студент групи АВ-109, Ситник Д. О.
    Логічний вираз ¬(¬X ∧ Y ) v (X ∧ ¬Z) записати на алгоритмічній мові і скласти для нього таблицю істинності,
    тобто визначити його значення для всіх можливих значень логічних змінних X, Y, Z.
    */
    /*
    int n=8, i;
    int x[] = {0, 1, 0, 0, 1, 1, 0, 0};
    int y[] = {0, 0, 1, 0, 1, 0, 1, 0};
    int z[] = {0, 0, 0, 1, 0, 1, 1, 0};
    bool maybe = true;
    
    cout << " ___________________________________" << endl;
    cout << "| X | Y | Z | ¬(¬X ∧ Y ) v (X ∧ ¬Z) |"<< endl;
    cout << "-------------------------------------" << endl;
    for (i=0; i<n; i++) {
        cout << "| " << x[i] << " | " << y[i] << " | " << z[i] << " |           " << int(!( !(x[i]) and y[i] ) or (x[i] and !(z[i]))) << "           |" << endl;
        if (i != n-1){
            cout << "-------------------------------------" << endl;
        }
        else {
            cout << "¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯" << endl;
        }
    }
    */
    
    
    
    /*
    Виконання завдання №3 варіант №14, студент групи АВ-109, Ситник Д. О.
    Дано числа від 1 до 1000 і число m. Вивести результат цілочисельного ділення непарних сотень на число m.
    */
    /*
    int m=14, i, result; // m = 14, бо мій варіант 14-ий
    
    for (i=1; i < 1000; i += 99) {
        if ( (i % 200) != 0 and i > 99) {
            result = i % m;
            cout << "Результа цілочисельного ділення " << i << " на " << m << " = " << result  << endl;
            i += 101;
        }
    }
    */
    
    
    
    /*
    Виконання завдання №4 варіант №14, студент групи АВ-109, Ситник Д. О.
    Ввести цілочисельний масив, що складається з 17 елементів. Замінити елементи кратні трьом на суму непарних за значенням елементів.
    */
    /*
    int n=17, i, sum=0;
    int my_arr[] = {1,2,3,4,5,6,7,8,9,10,11,12,13,14, 15, 16, 17};
    for (i=0; i < n; i++) {
        if ((my_arr[i] % 2) != 0) {
            sum += my_arr[i];
        }
    }
    for (i=0; i < n; i++) {
        if ((my_arr[i] % 3) == 0) {
            my_arr[i] = sum;
        }
    }
    
    cout << "my_arr[] = {";
    for (i=0; i < n; i++) {
        if (i != n-1) {
            cout << my_arr[i] << ", ";
        }
        else {
            cout << my_arr[i] << "}" << endl;
        }
    }
    */
    
    
    
    return 0;
}